Repository: Dudzioszek/CV_Website
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: pl

source: All rights reserved.
pl: Wszelkie prawa zastrzeżone.

source: My Personal Website
pl: Moja Personalna Strona

source: About Me
pl: O mnie

source: I am a passionate technologist and programmer. I specialize in creating modern websites and applications. Currently, I am studying Applied Computer Science at the Warsaw University of Technology. I have experience working as a programmer at Zending.ai, where I designed and implemented backend logic and managed databases. I also work part-time at Testsolution Sp. Z O.O., dealing with the servicing and sale of laboratory equipment.
pl: Jestem pasjonatem technologii i programowania. Specjalizuję się w tworzeniu nowoczesnych stron internetowych i aplikacji. Obecnie studiuję informatykę stosowaną na Politechnice Warszawskiej. Mam doświadczenie jako programista w Zending.ai, gdzie projektowałem i implementowałem logikę backendu oraz zarządzałem bazami danych. Pracuję również dorywczo w Testsolution Sp. Z O.O., zajmując się serwisowaniem i sprzedażą sprzętu laboratoryjnego.

source: My skills include knowledge of programming languages such as C, C++, Java, and Python, as well as working in Azure DevOps and Scrum. I also have skills in computer repair and the use of graphic programs (Photoshop) and Microsoft Office.
pl: Moje umiejętności obejmują znajomość języków programowania takich jak C, C++, Java i Python, a także pracę w Azure DevOps i Scrum. Posiadam również umiejętności naprawy komputerów oraz obsługi programów graficznych (Photoshop) i Microsoft Office.

source: In my free time, I am interested in European history, cycling, technological innovations, computer games, and volleyball.
pl: W wolnym czasie interesuję się historią Europy, kolarstwem, nowinkami technologicznymi, grami komputerowymi i siatkówką.

source: Projects
pl: Projekty

source: Check out my most important projects:
pl: Zapoznaj się z moimi najważniejszymi projektami:

source: View my key projects:
pl: Zobacz moje kluczowe projekty:

source: Download my CV to learn more about my professional experience and skills.
pl: Pobierz moje CV, aby dowiedzieć się więcej o moim doświadczeniu zawodowym i umiejętnościach.

source: Download CV
pl: Pobierz CV

source: My Projects
pl: Moje Projekty

source: Project 1: Database Management System
pl: Projekt 1: System Zarządzania Bazą Danych

source: Description: A database management system for a small business. The system allows managing customer data, orders, and products.
pl: Opis: System zarządzania bazą danych dla małej firmy. System pozwala na zarządzanie danymi klientów, zamówieniami i produktami.

source: Technologies: Python, Django, PostgreSQL
pl: Technologie: Python, Django, PostgreSQL

source: GitHub Repository
pl: Repozytorium GitHub

source: Project 2: E-commerce Website
pl: Projekt 2: Strona E-commerce

source: Description: A comprehensive e-commerce website with a shopping cart, online payments, and product management system.
pl: Opis: Kompleksowa strona e-commerce z koszykiem zakupów, płatnościami online i systemem zarządzania produktami.

source: Technologies: JavaScript, React, Node.js, MongoDB
pl: Technologie: JavaScript, React, Node.js, MongoDB

source: Project 3: Activity Tracking Mobile App
pl: Projekt 3: Aplikacja Mobilna do Śledzenia Aktywności

source: Description: A mobile application for tracking physical activities such as running, cycling, etc.
pl: Opis: Aplikacja mobilna do śledzenia aktywności fizycznych, takich jak bieganie, jazda na rowerze itp.

source: Technologies: Java, Android Studio, Firebase
pl: Technologie: Java, Android Studio, Firebase
